# csv

In [1]:
a = open('csvtest.csv','w')
a.close()

# append in csv file

In [5]:
b = open('csvtest.csv', 'w')
b.write("Name,Physics,Chemistry,Math,English,Nepali\n")

n = int(input("Enter the no of students = "))
for i in range(n):
    name = input("Enter name = ")
    physics = int(input("Enter the marks in physics = "))
    chemistry = int(input("Enter the marks in chemistry = "))
    math = int(input("Enter the marks in math = "))
    english = int(input("Enter the marks in english = "))
    nepali = int(input("Enter the marks in nepali = "))
    b.write(f"{name},{physics},{chemistry},{math},{english},{nepali}\n")
b.close()

Enter the no of students = 3
Enter name = Ram
Enter the marks in physics = 80
Enter the marks in chemistry = 84
Enter the marks in math = 85
Enter the marks in english = 78
Enter the marks in nepali = 79
Enter name = Shyam
Enter the marks in physics = 90
Enter the marks in chemistry = 95
Enter the marks in math = 99
Enter the marks in english = 89
Enter the marks in nepali = 88
Enter name = Sita
Enter the marks in physics = 90
Enter the marks in chemistry = 94
Enter the marks in math = 95
Enter the marks in english = 85
Enter the marks in nepali = 84

In [7]:
b = open('csvtest.csv', 'a')

n = int(input("Enter the no of students = "))
for i in range(n):
    name = input("Enter name = ")
    physics = int(input("Enter the marks in physics = "))
    chemistry = int(input("Enter the marks in chemistry = "))
    math = int(input("Enter the marks in math = "))
    english = int(input("Enter the marks in english = "))
    nepali = int(input("Enter the marks in nepali = "))
    b.write(f"{name},{physics},{chemistry},{math},{english},{nepali}\n")
b.close()

Enter the no of students = 2
Enter name = Hari
Enter the marks in physics = 84
Enter the marks in chemistry = 85
Enter the marks in math = 88
Enter the marks in english = 87
Enter the marks in nepali = 87
Enter name = Gita
Enter the marks in physics = 88
Enter the marks in chemistry = 84
Enter the marks in math = 89
Enter the marks in english = 97
Enter the marks in nepali = 88

In [2]:
import pandas as pd

x = pd.read_csv("csvtest.csv")
x.head()

    Name  Physics  Chemistry  Math  English  Nepali
0    Ram       80         84    85       78      79
1  Shyam       90         95    99       89      88
2   Sita       90         94    95       85      84
3   Name  Physics  Chemistry  Math  English  Nepali
4   Name  Physics  Chemistry  Math  English  Nepali

# Drop the 3

In [3]:
x.drop([3], axis=0, inplace= True)

In [15]:
x.head()

    Name  Physics  Chemistry  Math  English  Nepali
0    Ram       80         84    85       78      79
1  Shyam       90         95    99       89      88
2   Sita       90         94    95       85      84
4   Name  Physics  Chemistry  Math  English  Nepali
5   Hari       84         85    88       87      87

# Drop the 4

In [4]:
x.drop([4], axis=0, inplace = True)
x.head()

    Name Physics Chemistry Math English Nepali
0    Ram      80        84   85      78     79
1  Shyam      90        95   99      89     88
2   Sita      90        94   95      85     84
5   Hari      84        85   88      87     87
6   Gita      88        84   89      97     88

# drop the row  and column

In [ ]:
# axis = 0 for column
# axis = 1 for row
# inplace = True (To make the changes)

X.drop(["name of the column"], axis=1, inplace = True)

# split

In [10]:
a = x.iloc[:,0:2].values
print(a)

[['Ram' '80']
 ['Shyam' '90']
 ['Sita' '90']
 ['Hari' '84']
 ['Gita' '88']]